app/views/home/index.html.erb

<% if user_signed_in? %>
	<% if current_user.pets.first %>
---
SELECT "pets".* FROM "pets" WHERE "pets"."user_id" = ?  [["user_id", 1]]


	<% if Favorite.where(:user_id => current_user.id).first %>
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? ORDER BY "favorites"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

			<p>
			<%= Pet.where(:id => fav[:pet_id]).first[:name] %>
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? ORDER BY "pets"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]