app/controllers/favorites_controller.rb

  	def favorite
		pet = Pet.find(params[:id])
		curr = current_user
		Favorite.create(:user_id => current_user.id, :pet_id => params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("created_at", "updated_at", "user_id", "pet_id") VALUES (?, ?, ?, ?)  [["created_at", "2017-11-23 10:10:20.073000"], ["updated_at", "2017-11-23 10:10:20.073000"], ["user_id", 1], ["pet_id", 1]]