app/controllers/home_controller.rb

SELECT "pets".* FROM "pets"
---
	def index
		@pets = Pet.search(params[:search])