app/controllers/pets_controller.rb

	def adopt
		@pet = Pet.find params[:id] #this will depend on how we implement the adoption button etc.
		@pet.user_id = user.id
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]