app/controllers/pets_controller.rb

	def create
		pet = Pet.new
		pet.update(params.require(:pets).permit(:name, :species, :activity_level, :personality, :size, :image))

 	    if pet.save
---
INSERT INTO "pets" ("created_at", "updated_at", "name", "activity_level", "personality", "size", "species") VALUES (?, ?, ?, ?, ?, ?, ?)

	def adopt
		pet = Pet.find(params[:id])
		pet.user_id = current_user.id

		pet.save
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pets" SET "user_id" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["user_id", 1], ["updated_at", "2017-11-23 09:13:48.558021"], ["id", 1]]

	def show
		@pet = Pet.find(params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]